Repository: muzappar9/software-
Catalog: lib/l10n/app_*.arb
Languages: ug, zh

# appTitle
source: Legal Advisor
ug: قانۇن مەسلىھەتچىسى
zh: 法律顾问

source: New chat
ug: يېڭى سۆھبەت
zh: 新建对话

source: Chat history
ug: سۆھبەت تارىخى
zh: 聊天记录

source: Personal database
ug: شەخسى مەنبە
zh: 个人数据库

source: Legal database
ug: قانۇن مەنبەسى
zh: 法律数据库

source: Legal Q&A
ug: قانۇن سوئال-جاۋاب
zh: 法律问答

source: Legal study
ug: قانۇن ئۆگىنىش
zh: 法律学习

source: Help & feedback
ug: ياردەم ۋە ئىنكاس
zh: 帮助与反馈

source: Settings
ug: تەڭشەك
zh: 设置

source: Language
ug: تىل
zh: 语言

source: Theme
ug: تەمى
zh: 主题

source: Light
ug: ياقتۇرۇش
zh: 浅色

source: Dark
ug: قاراڭغۇ
zh: 深色

source: System
ug: سىستېما
zh: 跟随系统

source: Start
ug: باشلاش
zh: 开始

source: Cancel
ug: بىكار
zh: 取消

source: Confirm
ug: جەزملەش
zh: 确认

source: Send
ug: يوللاش
zh: 发送

# typing
source: Thinkingâ€¦
ug: ئوйлانىۋاتىدۇ…
zh: 思考中…

# welcome
source: Hi, I am your on-device legal intake assistant.
ug: ياخشىمۇسىز، مەن يەردىكى قانۇن قوبۇل قىلىش ياردەمچىسى.
zh: 你好，我是本地法律接待助手。

# askYourIssue
source: Briefly describe your issue (e.g., I want a divorce).
ug: مەسىلىڭىزنى قىسقا چۈشەندۈرۈڭ (مەس: ئايرىلىشنى خالايمەن).
zh: 请简单描述你的问题（例如：我想离婚）。

# askDivorce
source: I want a divorce
ug: مەن ئايرىلىشماقچى
zh: 我想离婚

# marriageYears
source: Years of marriage
ug: نڪيھ يىللىرى
zh: 结婚年数

# hasChildren
source: Any minor children
ug: ياش بالилар بارمۇ
zh: 是否有未成年子女

# childrenAge
source: Children's age
ug: بالилар ياشى
zh: 子女年龄

source: Joint assets
ug: ئورتاق مال-مۈلۈك
zh: 共同财产情况

# reason
source: Reason for divorce
ug: ئايرىلىش سەۋەبى
zh: 离婚原因

# reasonIncompatibility
source: Incompatibility
ug: خۇلق-خۇي ماس كەلمەيدۇ
zh: 性格不合

# reasonSeparation
source: Separated over one year
ug: بىر يىل ئاجرىلىپ تۇرغان
zh: 分居满一年

# reasonDV
source: Domestic violence
ug: ئىچكى زوراۋانلىق
zh: 家暴

# reasonAffair
source: Affair
ug: باشقا مەسىلە
zh: 出轨

# reasonOther
source: Other
ug: باشقا
zh: 其他

# riskDomesticViolence
source: Domestic-violence/high-risk situation detected. Seek professional help.
ug: زوراۋانلىق خەۋپى بايقالدى، مۇتەخەسسىسقا كېلىڭ.
zh: 检测到家暴等高风险情形，建议尽快寻求专业协助。

# riskMinor
source: Minors involved; consult a professional.
ug: بالилар قاتناشقان، مۇتەخەسسىسقا كۆرىڭ.
zh: 涉及未成年人争议，建议专业律师介入。

# riskCrossBorder
source: Cross-border factors; professional review recommended.
ug: چېگرا ئاتلاپ ئالاقە بار، تەكشۈرۈش كېرەك.
zh: 涉外因素较复杂，建议专业审查。

# upgradePro
source: Upgrade to pro answer
ug: Mutaxassis جاۋابىغا يۈكسەلتۈش
zh: 升级为专业解答

source: Finish
ug: تامام
zh: 完成

source: Retry
ug: قايتا سىناش
zh: 重试

# networkError
source: Backend not reachable. Please ensure the service is running.
ug: ئات-ئارقا باغلىنالمىدى، مۇلازىمەتنى تەكشۈرۈڭ.
zh: 后端连接失败，请确认服务已启动。

# offlineReady
source: Offline ready: on-device model loaded
ug: تورسىز ئىشلىيدۇ: يەردىكى مودېل تەييار
zh: 离线可用：本地模型已就绪

# modelNotLoaded
source: Model not loaded; using template fallback
ug: مودېل يۈكلەنمىدى، قالپاق جاۋاب ئىشلىتىلدى
zh: 模型未加载，已使用模板回答

source: Import model
ug: مودېل ئەكىرىش
zh: 导入模型

source: Model installed
ug: مودېل ئورنىتىلغان
zh: 模型已安装

# modelMissing
source: Model not installed yet
ug: مودېل تېخى يوق
zh: 尚未安装模型

source: Open LawPack
ug: قانۇن مەنبەسىنى ئاچ
zh: 打开法库

source: LawPack ready
ug: قانۇن مەنبەسى تەييار
zh: 法库已就绪

# lawPackMissing
source: LawPack missing or outdated
ug: قانۇن مەنبەسى يوق ياكى كونى
zh: 法库缺失或版本过旧

# slotNext
source: Please provide more details
ug: تەپسىلات قوشۇڭ
zh: 请继续补充信息

# askYearsAndSeparation
source: How many years married? Are you currently separated?
ug: نەچچە يىل نىكاھتا؟ ھازىر ئايرىمىزму؟
zh: 你们结婚几年了？目前是否分居？

# askChildren
source: Any minor children? About what age?
ug: ياش بالилар بارمۇ؟ نەچچە ياشتا؟
zh: 有未成年子女吗？大概几岁？

# askAssets
source: Joint assets (house/car/savings/mortgage/loan)?
ug: ئورتاق مال-مۈلۈك (ئۆي/ماشىنا/ئامانەت/كەرىز/قەرەز)؟
zh: 婚后共同财产概况（房/车/存款/贷款）？

# askReason
source: Main reason? (incompatibility/separated 1y/DV/affair/other)
ug: ئاساسلىق سەۋەپ؟ (ماس كەلمەسلىك/ بىر يىل ئايرىم/ زوراۋانلىق/ باشقا/ باشقا)
zh: 主要离婚原因是？（性格不合/分居满一年/家暴/出轨/其他）

# shortAdviceHeader
source: Brief advice
ug: قىسقا مەسلىھەت
zh: 简要建议

# disclaimer
source: This is general information, not legal advice; consult a lawyer for complex cases.
ug: بۇ ئومۇمىي ئۇچۇر، قانۇن مەسلىھىتى ئەمەس؛ مۇراسىملىق ئىشلارغا ئادىۋوكات بىلەن كېڭىشىڭ.
zh: 以上为一般性信息，非正式法律意见；复杂情形请咨询律师。

source: Share
ug: ھەمبەھىر
zh: 分享

source: Copy
ug: كۆچۈرۈش
zh: 复制

source: Saved
ug: ساقلاندى
zh: 已保存

source: Delete
ug: ئۆچۈرۈش
zh: 删除
